In [200]:
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
import seaborn as sns

# Load Data

In [201]:
book_path = r"preprocessed_data\book_processed.csv"
rating_path = r"preprocessed_data\rating_processed.csv"
user_data = r"preprocessed_data\user_processed.csv"

In [202]:
book_df = pd.read_csv(book_path)
book_df.drop(columns=["Unnamed: 0"], inplace=True)
book_df.sort_values(by=["ISBN"], inplace=True)
book_df.reset_index(drop=True, inplace=True)

rating_df = pd.read_csv(rating_path)
rating_df.drop(columns=["Unnamed: 0"], inplace=True)
rating_df.sort_values(by=["User-ID", "ISBN"], inplace=True)
rating_df.reset_index(drop=True, inplace=True)

user_df = pd.read_csv(user_data)
user_df.drop(columns=["Unnamed: 0"], inplace=True)
user_df.sort_values(by=["User-ID"], inplace=True)
user_df.reset_index(drop=True, inplace=True)

print("Books")
display(book_df.head(3))
print("Ratings")
display(rating_df.head(3))
print("Users")
display(user_df.head(3))

Books

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0000913154,The Way Things Work: An Illustrated Encycloped...,C. van Amerongen (translator),1967.0,Simon &amp; Schuster
1,0001010565,Mog's Christmas,Judith Kerr,1992.0,Collins
2,0001046438,Liar,Stephen Fry,NaN,Harpercollins Uk

Ratings

   User-ID        ISBN  Book-Rating
0        2  0195153448            0
1        8  0002005018            5
2        8  0060973129            0

Users

   User-ID                         Location  Age
0        1               nyc, new york, usa   34
1        2        stockton, california, usa   18
2        3  moscow, yukon territory, russia   34

# Data Preparation

## include book cover images

In [203]:
from IPython.core.display_functions import display
temp_df = pd.read_csv("dataset\Books.csv")
select_col = ["ISBN", "Image-URL-L"]
temp_df = temp_df[select_col]

book_df = pd.merge(book_df, temp_df, on="ISBN", how="left")

print("Books")
display(book_df.head(3))

C:\Users\Jimmy\AppData\Local\Temp\ipykernel_20376\4259117308.py:2: DtypeWarning: Columns (0: Year-Of-Publication) have mixed types. Specify dtype option on import or set low_memory=False.
  temp_df = pd.read_csv("dataset\Books.csv")

Books

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-L
0,0000913154,The Way Things Work: An Illustrated Encycloped...,C. van Amerongen (translator),1967.0,Simon &amp; Schuster,http://images.amazon.com/images/P/0000913154.0...
1,0001010565,Mog's Christmas,Judith Kerr,1992.0,Collins,http://images.amazon.com/images/P/0001010565.0...
2,0001046438,Liar,Stephen Fry,NaN,Harpercollins Uk,http://images.amazon.com/images/P/0001046438.0...

## fill one missing author's name to "Unknown" in books

In [204]:
book_df.loc[book_df["Book-Author"].isna(), "Book-Author"] = "Unknown"

## change published year to int

In [205]:
book_df['Year-Of-Publication'] = book_df['Year-Of-Publication'].astype('Int64')

## create seperate author and publisher table

In [206]:
author_df = pd.DataFrame()
author_df["name"] = book_df["Book-Author"].unique()
author_df["author_id"] = author_df.index
author_df = author_df[["author_id", "name"]]

publisher_df = pd.DataFrame()
publisher_df["name"] = book_df["Publisher"].unique()
publisher_df["publisher_id"] = publisher_df.index
publisher_df = publisher_df[["publisher_id", "name"]]

print("Authors")
display(author_df.head(3))
print("Publishers")
display(publisher_df.head(3))

Authors

   author_id                           name
0          0  C. van Amerongen (translator)
1          1                    Judith Kerr
2          2                    Stephen Fry

Publishers

   publisher_id                  name
0             0  Simon &amp; Schuster
1             1               Collins
2             2      Harpercollins Uk

## replace author, and publisher with id on books table

In [207]:
book_df = pd.merge(book_df,author_df, left_on="Book-Author", right_on="name", how="left")
book_df.drop(columns=["Book-Author","name"], inplace=True)

book_df = pd.merge(book_df,publisher_df, left_on="Publisher", right_on="name", how="left")
book_df.drop(columns=["Publisher","name"], inplace=True)
print("Books")
display(book_df.head(3))

Books

,ISBN,Book-Title,Year-Of-Publication,Image-URL-L,author_id,publisher_id
0,0000913154,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,0001010565,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,0001046438,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2

## create new book_id then drop the old one (ISBN) on books & ratings tables

In [208]:
book_df.sort_values("ISBN", inplace=True)
book_df.reset_index(inplace=True)
book_df.rename(columns={"index":"book_id"}, inplace=True)

rating_df = pd.merge(rating_df, book_df[["ISBN", "book_id"]], on="ISBN", how="left")
rating_df.drop(columns="ISBN", inplace=True)

book_df.drop(columns="ISBN", inplace=True)

print("Books")
display(book_df.head(3))

print("Ratings")
display(rating_df.head(3))

Books

,book_id,Book-Title,Year-Of-Publication,Image-URL-L,author_id,publisher_id
0,0,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,1,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,2,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2

Ratings

   User-ID  Book-Rating  book_id
0        2            0    25028
1        8            5       73
2        8            0     8211

## use birth year instead of age on Users table

In [209]:
import datetime
user_df["birth_year"] = datetime.datetime.now().year-user_df["Age"]
user_df.drop(columns="Age", inplace=True)

## replace the rating == 0 in to NaN in ratings table

In [210]:
rating_df.loc[rating_df["Book-Rating"]==0, "Book-Rating"] = pd.NA
# rating_df.dropna(axis=0, subset=["Book-Rating"], inplace=True)

print("ratings")
display(rating_df.sample(3))

ratings

        User-ID  Book-Rating  book_id
778009   212898          NaN    58080
869340   235529         10.0   118084
372974   101851         10.0   179750

## rename columns in all tables

In [211]:
new_columns_map = {"Book-Title" : "name",
                   "Year-Of-Publication" : "published_year",
                   "Image-URL-L" : "image_url"}
book_df.rename(columns=new_columns_map, inplace=True)

new_columns_map = {"Book-Rating" : "book_rating",
                   "User-ID": "user_id"}
rating_df.rename(columns=new_columns_map, inplace=True)

new_columns_map = {"User-ID" : "user_id",
                   "Location" : "location"}
user_df.rename(columns=new_columns_map, inplace=True)

## show all tables

In [212]:
all_df = {"Books" : book_df, 
          "Ratings" : rating_df, 
          "Users" : user_df, 
          "Authors" : author_df, 
          "Publishers" : publisher_df}
for name, df in all_df.items():
    print(name)
    display(df.head(3))

Books

,book_id,name,published_year,image_url,author_id,publisher_id
0,0,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,1,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,2,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2

Ratings

   user_id  book_rating  book_id
0        2          NaN    25028
1        8          5.0       73
2        8          NaN     8211

Users

   user_id                         location  birth_year
0        1               nyc, new york, usa        1992
1        2        stockton, california, usa        2008
2        3  moscow, yukon territory, russia        1992

Authors

   author_id                           name
0          0  C. van Amerongen (translator)
1          1                    Judith Kerr
2          2                    Stephen Fry

Publishers

   publisher_id                  name
0             0  Simon &amp; Schuster
1             1               Collins
2             2      Harpercollins Uk

# Data Trasformation

## add new fields to Users table

In [213]:
import numpy as np
user_df["username"] = pd.NA
user_df["email"] = pd.NA
user_df["user_image"] = pd.NA
user_df = user_df[["user_id", "username", "birth_year", "email", "location", "user_image"]]

# add new user with username and email
new_user = [user_df.user_id.max().item() + 1, "Jimmoi", "2004", "amonthep.se@kkumail.com", "Nongkrusri, kalasin, th", pd.NA]
user_df.loc[len(user_df)] = new_user
print("Users")
user_df.tail(3)

Users

,user_id,username,birth_year,email,location,user_image
278856,278857,<NA>,1992,<NA>,"knoxville, tennessee, usa",<NA>
278857,278858,<NA>,1992,<NA>,"dublin, n/a, ireland",<NA>
278858,278859,Jimmoi,2004,amonthep.se@kkumail.com,"Nongkrusri, kalasin, th",<NA>

## add new fields to ratings table

In [214]:
rating_df["comment"] = pd.NA
rating_df["is_favourite"] = False
rating_df = rating_df[["user_id", "book_id", "book_rating", "comment", "is_favourite"]]


# add some random favourite
high_rating_mask = rating_df[rating_df["book_rating"]>8].sample(frac=0.2, random_state=42).index
no_rating_mask = rating_df[rating_df["book_rating"].isna()].sample(frac=0.05, random_state=42).index
mask_index = high_rating_mask.union(no_rating_mask)
rating_df.loc[mask_index,"is_favourite"] = True

# add some random review
mask = rating_df.sample(frac=0.5).index
rating_df.loc[mask,"comment"] = "This is a comment"

print("ratings")
rating_df.head()

ratings

   user_id  book_id  book_rating            comment  is_favourite
0        2    25028          NaN               <NA>         False
1        8       73          5.0  This is a comment         False
2        8     8211          NaN  This is a comment         False
3        8    60198          NaN  This is a comment         False
4        8    71711          NaN  This is a comment         False

## create new table user_wishlist

In [215]:
user_wishlist_df = user_df.sample(frac=0.005).merge(book_df.sample(frac=0.005, random_state=42), how='cross')
user_wishlist_df = user_wishlist_df[["user_id", "book_id"]]
user_wishlist_df = pd.merge(user_wishlist_df, rating_df, on=["user_id", "book_id"], how="left", indicator=True)
user_wishlist_df = user_wishlist_df[user_wishlist_df['_merge'] == 'left_only']
user_wishlist_df = user_wishlist_df[["user_id", "book_id"]]
user_wishlist_df["is_favourite"] = False
user_wishlist_df.loc[user_wishlist_df.sample(frac=0.5).index, "is_favourite"] = True

print("user_wishlist")
user_wishlist_df.sample(10)

user_wishlist

         user_id  book_id  is_favourite
836050    158464   135587          True
184721    115406   238048          True
312367    163583    70666          True
1056235    73658   109335          True
1513345   226862    12482         False
1136472   147885    49090          True
1129538    10379   105414         False
822974     18413   234960         False
1588991    22908   265514          True
576085    247156   208468          True

## rename id column

In [216]:
book_df.rename(columns={"book_id":"id"}, inplace = True)
author_df.rename(columns={"author_id":"id"}, inplace = True)
publisher_df.rename(columns={"publisher_id":"id"}, inplace = True)
user_df.rename(columns={"user_id":"id"}, inplace = True)

In [217]:

all_df = {"Books" : book_df, 
          "user_reviews" : rating_df, 
          "Users" : user_df, 
          "Authors" : author_df, 
          "Publishers" : publisher_df,
          "user_wishlists" : user_wishlist_df}
for name, df in all_df.items():
    print(name)
    display(df.head(3))

Books

,id,name,published_year,image_url,author_id,publisher_id
0,0,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,1,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,2,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2

user_reviews

   user_id  book_id  book_rating            comment  is_favourite
0        2    25028          NaN               <NA>         False
1        8       73          5.0  This is a comment         False
2        8     8211          NaN  This is a comment         False

Users

   id username birth_year email                         location user_image
0   1     <NA>       1992  <NA>               nyc, new york, usa       <NA>
1   2     <NA>       2008  <NA>        stockton, california, usa       <NA>
2   3     <NA>       1992  <NA>  moscow, yukon territory, russia       <NA>

Authors

   id                           name
0   0  C. van Amerongen (translator)
1   1                    Judith Kerr
2   2                    Stephen Fry

Publishers

   id                  name
0   0  Simon &amp; Schuster
1   1               Collins
2   2      Harpercollins Uk

user_wishlists

   user_id  book_id  is_favourite
0   155010   103740         False
1   155010   195299          True
2   155010   161791         False

# save

In [218]:
book_df

,id,name,published_year,image_url,author_id,publisher_id
0,0,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,1,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,2,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2
3,3,Twopence to Cross the Mersey,1992,http://images.amazon.com/images/P/0001046713.0...,3,3
4,4,"T.S. Eliot Reading \The Wasteland\"" and Other ...",1993,http://images.amazon.com/images/P/000104687X.0...,4,3
...,...,...,...,...,...,...
271355,271355,Falling Angels,2001,http://images.amazon.com/images/P/B000234N76.0...,37862,1942
271356,271356,It Must've Been Something I Ate: The Return of...,2002,http://images.amazon.com/images/P/B000234NC6.0...,24612,1367
271357,271357,"Good Wife Strikes Back, The",<NA>,http://images.amazon.com/images/P/B00029DGGO.0...,13,16802
271358,271358,The Blockade Runners,<NA>,http://images.amazon.com/images/P/B0002JV9PY.0...,1429,16803
271359,271359,The Underground City,<NA>,http://images.amazon.com/images/P/B0002K6K8O.0...,1429,16803

In [219]:
output_dir = Path("data_for_db")
for name, df in all_df.items():
    df.to_csv(output_dir/(name+".csv"), index=False)

In [220]:
book_df

,id,name,published_year,image_url,author_id,publisher_id
0,0,The Way Things Work: An Illustrated Encycloped...,1967,http://images.amazon.com/images/P/0000913154.0...,0,0
1,1,Mog's Christmas,1992,http://images.amazon.com/images/P/0001010565.0...,1,1
2,2,Liar,<NA>,http://images.amazon.com/images/P/0001046438.0...,2,2
3,3,Twopence to Cross the Mersey,1992,http://images.amazon.com/images/P/0001046713.0...,3,3
4,4,"T.S. Eliot Reading \The Wasteland\"" and Other ...",1993,http://images.amazon.com/images/P/000104687X.0...,4,3
...,...,...,...,...,...,...
271355,271355,Falling Angels,2001,http://images.amazon.com/images/P/B000234N76.0...,37862,1942
271356,271356,It Must've Been Something I Ate: The Return of...,2002,http://images.amazon.com/images/P/B000234NC6.0...,24612,1367
271357,271357,"Good Wife Strikes Back, The",<NA>,http://images.amazon.com/images/P/B00029DGGO.0...,13,16802
271358,271358,The Blockade Runners,<NA>,http://images.amazon.com/images/P/B0002JV9PY.0...,1429,16803
271359,271359,The Underground City,<NA>,http://images.amazon.com/images/P/B0002K6K8O.0...,1429,16803